In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
train_df = pd.read_csv(r'C:\Users\salun\PycharmProjects\pythonProject_job_Aug\Titanic_dataset\train.csv')
test_df = pd.read_csv(r'C:\Users\salun\PycharmProjects\pythonProject_job_Aug\Titanic_dataset\test.csv')

In [3]:
train_df.shape

(891, 12)

In [4]:
test_df

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

# step 1

In [5]:
#correlation between 'Pclass', 'Sex', 'SibSp', 'Parch' and 'Survived'
train_df[['Pclass','Survived']].groupby(['Pclass'],as_index=False).mean().sort_values(by = 'Survived',ascending=False)
# train_df

   Pclass  Survived
0       1  0.629630
1       2  0.472826
2       3  0.242363

In [6]:
train_df[['Sex','Survived']].groupby(['Sex'],as_index=False).mean().sort_values(by = 'Survived',ascending=False)

      Sex  Survived
0  female  0.742038
1    male  0.188908

In [7]:
train_df[['SibSp','Survived']].groupby(['SibSp'],as_index=False).mean().sort_values(by = 'Survived',ascending=False)

   SibSp  Survived
1      1  0.535885
2      2  0.464286
0      0  0.345395
3      3  0.250000
4      4  0.166667
5      5  0.000000
6      8  0.000000

In [8]:
train_df[['Parch','Survived']].groupby(['Parch'],as_index=False).mean().sort_values(by = 'Survived',ascending=False)

   Parch  Survived
3      3  0.600000
1      1  0.550847
2      2  0.500000
0      0  0.343658
5      5  0.200000
4      4  0.000000
6      6  0.000000

# step 2

In [9]:
train_df = train_df.drop(['Ticket','Cabin'],axis = 1)
test_df = test_df.drop(['Ticket','Cabin'],axis = 1)
combine = [train_df, test_df]

In [10]:
combine[0].shape, combine[1].shape

((891, 10), (418, 9))

# step 3

In [11]:
for dataset in combine:
    dataset['Title'] = dataset.Name.str.extract('([A-Za-z]+)\.', expand= False)

In [12]:
pd.crosstab(train_df['Title'], train_df['Sex'])

Sex       female  male
Title
Capt           0     1
Col            0     2
Countess       1     0
Don            0     1
Dr             1     6
Jonkheer       0     1
Lady           1     0
Major          0     2
Master         0    40
Miss         182     0
Mlle           2     0
Mme            1     0
Mr             0   517
Mrs          125     0
Ms             1     0
Rev            0     6
Sir            0     1

In [13]:
for dataset in combine:
    dataset['Title'] = dataset['Title'].replace(['Lady', 'Capt', 'Col', 'Countess', 'Don', 'Dr', 'Jonkheer', 'Major', 'Rev', 'Sir'], 'Rare')
    dataset['Title'] = dataset['Title'].replace('Mlle','Miss')
    dataset['Title'] = dataset['Title'].replace('Ms','Miss')
    dataset['Title'] = dataset['Title'].replace('Mme','Miss')
train_df[['Title','Survived']].groupby(['Title'], as_index =False).mean()

    Title  Survived
0  Master  0.575000
1    Miss  0.704301
2      Mr  0.156673
3     Mrs  0.792000
4    Rare  0.347826

# step 4

In [14]:
title_mapping = {'Mr' : 1, 'Miss' : 2, 'Mrs' : 3, 'Master' : 4, 'Rare': 5}
for dataset in combine:
    dataset['Title'] = dataset['Title'].map(title_mapping)
    dataset['Title'] = dataset['Title'].fillna(0)
train_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Title
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C,3
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S,3
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S,1
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,13.0000,S,5
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,30.0000,S,2
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,23.4500,S,2
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,30.0000,C,1
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,7.7500,Q,1

# step 5

In [15]:
train_df = train_df.drop(['Name','PassengerId'], axis = 1)

In [16]:
train_df

     Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked  Title
0           0       3    male  22.0      1      0   7.2500        S      1
1           1       1  female  38.0      1      0  71.2833        C      3
2           1       3  female  26.0      0      0   7.9250        S      2
3           1       1  female  35.0      1      0  53.1000        S      3
4           0       3    male  35.0      0      0   8.0500        S      1
..        ...     ...     ...   ...    ...    ...      ...      ...    ...
886         0       2    male  27.0      0      0  13.0000        S      5
887         1       1  female  19.0      0      0  30.0000        S      2
888         0       3  female   NaN      1      2  23.4500        S      2
889         1       1    male  26.0      0      0  30.0000        C      1
890         0       3    male  32.0      0      0   7.7500        Q      1

[891 rows x 9 columns]

In [17]:
test_df = test_df.drop(['Name'], axis = 1)

In [18]:
combine = [train_df, test_df]

In [19]:
combine[0].shape, combine[1].shape

((891, 9), (418, 9))

# step 6

In [20]:
for dataset in combine:
    dataset['Sex'] = dataset['Sex'].map({'female': 1, 'male' : 0}).astype(int)
train_df

     Survived  Pclass  Sex   Age  SibSp  Parch     Fare Embarked  Title
0           0       3    0  22.0      1      0   7.2500        S      1
1           1       1    1  38.0      1      0  71.2833        C      3
2           1       3    1  26.0      0      0   7.9250        S      2
3           1       1    1  35.0      1      0  53.1000        S      3
4           0       3    0  35.0      0      0   8.0500        S      1
..        ...     ...  ...   ...    ...    ...      ...      ...    ...
886         0       2    0  27.0      0      0  13.0000        S      5
887         1       1    1  19.0      0      0  30.0000        S      2
888         0       3    1   NaN      1      2  23.4500        S      2
889         1       1    0  26.0      0      0  30.0000        C      1
890         0       3    0  32.0      0      0   7.7500        Q      1

[891 rows x 9 columns]

# step 7

In [21]:
guess_ages = np.zeros((2,3))
guess_ages

array([[0., 0., 0.],
       [0., 0., 0.]])

In [22]:
for dataset in combine:
    for i in range(0,2):
        for j in range(0,3):
            guess_df = dataset[(dataset['Sex'] == i) & (dataset['Pclass'] == j+1)]['Age'].dropna()
            age_guess = guess_df.mean() #median
            print('guessed ages ',age_guess)
            guess_ages[i, j] = int(age_guess/0.5 + 0.5) * 0.5  #rounding off
            print('i,j ',guess_ages[i, j])
    for i in range(0,2):
        for j in range(0,3):
            dataset.loc[(dataset.Age.isnull()) & (dataset.Sex == i) & (dataset.Pclass == j+1), 'Age'] = guess_ages[i,j]
    dataset['Age'] = dataset['Age'].astype(int)
train_df

guessed ages  41.28138613861386
i,j  41.5
guessed ages  30.74070707070707
i,j  30.5
guessed ages  26.507588932806325
i,j  26.5
guessed ages  34.61176470588235
i,j  34.5
guessed ages  28.722972972972972
i,j  28.5
guessed ages  21.75
i,j  22.0
guessed ages  40.52
i,j  40.5
guessed ages  30.940677966101696
i,j  31.0
guessed ages  24.525104166666665
i,j  24.5
guessed ages  41.333333333333336
i,j  41.5
guessed ages  24.376551724137933
i,j  24.5
guessed ages  23.073400000000003
i,j  23.0

     Survived  Pclass  Sex  Age  SibSp  Parch     Fare Embarked  Title
0           0       3    0   22      1      0   7.2500        S      1
1           1       1    1   38      1      0  71.2833        C      3
2           1       3    1   26      0      0   7.9250        S      2
3           1       1    1   35      1      0  53.1000        S      3
4           0       3    0   35      0      0   8.0500        S      1
..        ...     ...  ...  ...    ...    ...      ...      ...    ...
886         0       2    0   27      0      0  13.0000        S      5
887         1       1    1   19      0      0  30.0000        S      2
888         0       3    1   22      1      2  23.4500        S      2
889         1       1    0   26      0      0  30.0000        C      1
890         0       3    0   32      0      0   7.7500        Q      1

[891 rows x 9 columns]

In [23]:
train_df.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    2
Title       0
dtype: int64

# step 8

In [24]:
train_df['Ageband'] = pd.cut(train_df['Age'],5)
train_df['Ageband'].head()
# train_df[['Ageband','Survived']].groupby(['Ageband'],as_index=False).mean().sort_values(by = 'Survived',ascending=False)

0    (16.0, 32.0]
1    (32.0, 48.0]
2    (16.0, 32.0]
3    (32.0, 48.0]
4    (32.0, 48.0]
Name: Ageband, dtype: category
Categories (5, interval[float64]): [(-0.08, 16.0] < (16.0, 32.0] < (32.0, 48.0] < (48.0, 64.0] < (64.0, 80.0]]

In [25]:
train_df[['Ageband','Survived']].groupby(['Ageband'],as_index=False).mean().sort_values(by = 'Survived',ascending=False)

         Ageband  Survived
0  (-0.08, 16.0]  0.550000
3   (48.0, 64.0]  0.434783
2   (32.0, 48.0]  0.412037
1   (16.0, 32.0]  0.337374
4   (64.0, 80.0]  0.090909

# step 9

In [26]:
for dataset in combine:
    dataset.loc[dataset['Age'] <= 16 ,'Age'] = 0
    dataset.loc[(dataset['Age'] > 16) & (dataset['Age'] <= 32),'Age'] = 1
    dataset.loc[(dataset['Age'] > 32) & (dataset['Age'] <= 48),'Age'] = 2
    dataset.loc[(dataset['Age'] > 48) & (dataset['Age'] <= 64),'Age'] = 3
    dataset.loc[dataset['Age'] > 64,'Age'] 
# train_df
#why I am getting 'Age' column zero?

In [27]:
train_df.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Title,Ageband
0,0,3,0,1,1,0,7.2500,S,1,"(16.0, 32.0]"
1,1,1,1,2,1,0,71.2833,C,3,"(32.0, 48.0]"
2,1,3,1,1,0,0,7.9250,S,2,"(16.0, 32.0]"
3,1,1,1,2,1,0,53.1000,S,3,"(32.0, 48.0]"
4,0,3,0,2,0,0,8.0500,S,1,"(32.0, 48.0]"

In [28]:
train_df = train_df.drop(['Ageband'], axis = 1)

In [29]:
train_df

     Survived  Pclass  Sex  Age  SibSp  Parch     Fare Embarked  Title
0           0       3    0    1      1      0   7.2500        S      1
1           1       1    1    2      1      0  71.2833        C      3
2           1       3    1    1      0      0   7.9250        S      2
3           1       1    1    2      1      0  53.1000        S      3
4           0       3    0    2      0      0   8.0500        S      1
..        ...     ...  ...  ...    ...    ...      ...      ...    ...
886         0       2    0    1      0      0  13.0000        S      5
887         1       1    1    1      0      0  30.0000        S      2
888         0       3    1    1      1      2  23.4500        S      2
889         1       1    0    1      0      0  30.0000        C      1
890         0       3    0    1      0      0   7.7500        Q      1

[891 rows x 9 columns]

In [30]:
combine = [train_df, test_df]

In [31]:
combine

[     Survived  Pclass  Sex  Age  SibSp  Parch     Fare Embarked  Title
 0           0       3    0    1      1      0   7.2500        S      1
 1           1       1    1    2      1      0  71.2833        C      3
 2           1       3    1    1      0      0   7.9250        S      2
 3           1       1    1    2      1      0  53.1000        S      3
 4           0       3    0    2      0      0   8.0500        S      1
 ..        ...     ...  ...  ...    ...    ...      ...      ...    ...
 886         0       2    0    1      0      0  13.0000        S      5
 887         1       1    1    1      0      0  30.0000        S      2
 888         0       3    1    1      1      2  23.4500        S      2
 889         1       1    0    1      0      0  30.0000        C      1
 890         0       3    0    1      0      0   7.7500        Q      1

 [891 rows x 9 columns],
      PassengerId  Pclass  Sex  Age  SibSp  Parch      Fare Embarked  Title
 0            892       3    0    2      0      0    7.8292        Q    1.0
 1            893       3    1    2      1      0    7.0000        S    3.0
 2            894       2    0    3      0      0    9.6875        Q    1.0
 3            895       3    0    1      0      0    8.6625        S    1.0
 4            896       3    1    1      1      1   12.2875        S    3.0
 ..           ...     ...  ...  ...    ...    ...       ...      ...    ...
 413         1305       3    0    1      0      0    8.0500        S    1.0
 414         1306       1    1    2      0      0  108.9000        C    0.0
 415         1307       3    0    2      0      0    7.2500        S    1.0
 416         1308       3    0    1      0      0    8.0500        S    1.0
 417         1309       3    0    1      1      1   22.3583        C    4.0

 [418 rows x 9 columns]]

# step 10

In [32]:
for dataset in combine:
    dataset['Familysize'] = dataset['SibSp'] + dataset['Parch'] + 1
#why to add 1

In [33]:
train_df[['Familysize', 'Survived']].groupby(['Familysize'], as_index = False).mean().sort_values(by = 'Survived', ascending = False)

   Familysize  Survived
3           4  0.724138
2           3  0.578431
1           2  0.552795
6           7  0.333333
0           1  0.303538
4           5  0.200000
5           6  0.136364
7           8  0.000000
8          11  0.000000

# step 11

In [34]:
for dataset in combine:
    dataset['IsAlone'] = 0
    dataset.loc[dataset['Familysize'] == 1, 'IsAlone'] = 1

In [35]:
train_df[['IsAlone', 'Survived']].groupby(['IsAlone'], as_index = False).mean()

   IsAlone  Survived
0        0  0.505650
1        1  0.303538

In [36]:
combine

[     Survived  Pclass  Sex  Age  SibSp  Parch     Fare Embarked  Title  \
 0           0       3    0    1      1      0   7.2500        S      1
 1           1       1    1    2      1      0  71.2833        C      3
 2           1       3    1    1      0      0   7.9250        S      2
 3           1       1    1    2      1      0  53.1000        S      3
 4           0       3    0    2      0      0   8.0500        S      1
 ..        ...     ...  ...  ...    ...    ...      ...      ...    ...
 886         0       2    0    1      0      0  13.0000        S      5
 887         1       1    1    1      0      0  30.0000        S      2
 888         0       3    1    1      1      2  23.4500        S      2
 889         1       1    0    1      0      0  30.0000        C      1
 890         0       3    0    1      0      0   7.7500        Q      1

      Familysize  IsAlone
 0             2        0
 1             2        0
 2             1        1
 3             2        0
 4             1        1
 ..          ...      ...
 886           1        1
 887           1        1
 888           4        0
 889           1        1
 890           1        1

 [891 rows x 11 columns],
      PassengerId  Pclass  Sex  Age  SibSp  Parch      Fare Embarked  Title  \
 0            892       3    0    2      0      0    7.8292        Q    1.0
 1            893       3    1    2      1      0    7.0000        S    3.0
 2            894       2    0    3      0      0    9.6875        Q    1.0
 3            895       3    0    1      0      0    8.6625        S    1.0
 4            896       3    1    1      1      1   12.2875        S    3.0
 ..           ...     ...  ...  ...    ...    ...       ...      ...    ...
 413         1305       3    0    1      0      0    8.0500        S    1.0
 414         1306       1    1    2      0      0  108.9000        C    0.0
 415         1307       3    0    2      0      0    7.2500        S    1.0
 416         1308       3    0    1      0      0    8.0500        S    1.0
 417         1309       3    0    1      1      1   22.3583        C    4.0

      Familysize  IsAlone
 0             1        1
 1             2        0
 2             1        1
 3             1        1
 4             3        0
 ..          ...      ...
 413           1        1
 414           1        1
 415           1        1
 416           1        1
 417           3        0

 [418 rows x 11 columns]]

In [37]:
train_df = train_df.drop(['SibSp','Parch','Familysize'], axis = 1)

In [38]:
test_df = test_df.drop(['SibSp','Parch','Familysize'], axis = 1)

In [39]:
combine = [train_df, test_df]

In [40]:
combine

[     Survived  Pclass  Sex  Age     Fare Embarked  Title  IsAlone
 0           0       3    0    1   7.2500        S      1        0
 1           1       1    1    2  71.2833        C      3        0
 2           1       3    1    1   7.9250        S      2        1
 3           1       1    1    2  53.1000        S      3        0
 4           0       3    0    2   8.0500        S      1        1
 ..        ...     ...  ...  ...      ...      ...    ...      ...
 886         0       2    0    1  13.0000        S      5        1
 887         1       1    1    1  30.0000        S      2        1
 888         0       3    1    1  23.4500        S      2        0
 889         1       1    0    1  30.0000        C      1        1
 890         0       3    0    1   7.7500        Q      1        1

 [891 rows x 8 columns],
      PassengerId  Pclass  Sex  Age      Fare Embarked  Title  IsAlone
 0            892       3    0    2    7.8292        Q    1.0        1
 1            893       3    1    2    7.0000        S    3.0        0
 2            894       2    0    3    9.6875        Q    1.0        1
 3            895       3    0    1    8.6625        S    1.0        1
 4            896       3    1    1   12.2875        S    3.0        0
 ..           ...     ...  ...  ...       ...      ...    ...      ...
 413         1305       3    0    1    8.0500        S    1.0        1
 414         1306       1    1    2  108.9000        C    0.0        1
 415         1307       3    0    2    7.2500        S    1.0        1
 416         1308       3    0    1    8.0500        S    1.0        1
 417         1309       3    0    1   22.3583        C    4.0        0

 [418 rows x 8 columns]]

# step 12

In [41]:
for dataset in combine:
    dataset['Age*Pclass'] = dataset.Age * dataset.Pclass

In [42]:
train_df.loc[:,['Age*Pclass','Age','Pclass']]

     Age*Pclass  Age  Pclass
0             3    1       3
1             2    2       1
2             3    1       3
3             2    2       1
4             6    2       3
..          ...  ...     ...
886           2    1       2
887           1    1       1
888           3    1       3
889           1    1       1
890           3    1       3

[891 rows x 3 columns]

In [43]:
combine

[     Survived  Pclass  Sex  Age     Fare Embarked  Title  IsAlone  Age*Pclass
 0           0       3    0    1   7.2500        S      1        0           3
 1           1       1    1    2  71.2833        C      3        0           2
 2           1       3    1    1   7.9250        S      2        1           3
 3           1       1    1    2  53.1000        S      3        0           2
 4           0       3    0    2   8.0500        S      1        1           6
 ..        ...     ...  ...  ...      ...      ...    ...      ...         ...
 886         0       2    0    1  13.0000        S      5        1           2
 887         1       1    1    1  30.0000        S      2        1           1
 888         0       3    1    1  23.4500        S      2        0           3
 889         1       1    0    1  30.0000        C      1        1           1
 890         0       3    0    1   7.7500        Q      1        1           3

 [891 rows x 9 columns],
      PassengerId  Pclass  Sex  Age      Fare Embarked  Title  IsAlone  \
 0            892       3    0    2    7.8292        Q    1.0        1
 1            893       3    1    2    7.0000        S    3.0        0
 2            894       2    0    3    9.6875        Q    1.0        1
 3            895       3    0    1    8.6625        S    1.0        1
 4            896       3    1    1   12.2875        S    3.0        0
 ..           ...     ...  ...  ...       ...      ...    ...      ...
 413         1305       3    0    1    8.0500        S    1.0        1
 414         1306       1    1    2  108.9000        C    0.0        1
 415         1307       3    0    2    7.2500        S    1.0        1
 416         1308       3    0    1    8.0500        S    1.0        1
 417         1309       3    0    1   22.3583        C    4.0        0

      Age*Pclass
 0             6
 1             6
 2             6
 3             3
 4             3
 ..          ...
 413           3
 414           2
 415           6
 416           3
 417           3

 [418 rows x 9 columns]]

# step 13

In [44]:
freq_port = train_df.Embarked.dropna().mode()[0]

In [45]:
freq_port

'S'

In [46]:
for dataset in combine:
    dataset['Embarked'] = dataset['Embarked'].fillna(freq_port)

In [47]:
train_df[['Embarked', 'Survived']].groupby(['Embarked'], as_index = False).mean().sort_values(by = 'Survived', ascending = False)

  Embarked  Survived
0        C  0.553571
1        Q  0.389610
2        S  0.339009

In [48]:
train_df.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age           0
Fare          0
Embarked      0
Title         0
IsAlone       0
Age*Pclass    0
dtype: int64

# step 14

In [49]:
for dataset in combine:
    dataset['Embarked'] = dataset['Embarked'].map({'S': 0, 'C' : 1, 'Q': 2}).astype(int)

In [50]:
train_df

     Survived  Pclass  Sex  Age     Fare  Embarked  Title  IsAlone  Age*Pclass
0           0       3    0    1   7.2500         0      1        0           3
1           1       1    1    2  71.2833         1      3        0           2
2           1       3    1    1   7.9250         0      2        1           3
3           1       1    1    2  53.1000         0      3        0           2
4           0       3    0    2   8.0500         0      1        1           6
..        ...     ...  ...  ...      ...       ...    ...      ...         ...
886         0       2    0    1  13.0000         0      5        1           2
887         1       1    1    1  30.0000         0      2        1           1
888         0       3    1    1  23.4500         0      2        0           3
889         1       1    0    1  30.0000         1      1        1           1
890         0       3    0    1   7.7500         2      1        1           3

[891 rows x 9 columns]

In [51]:
test_df.isnull().sum()

PassengerId    0
Pclass         0
Sex            0
Age            0
Fare           1
Embarked       0
Title          0
IsAlone        0
Age*Pclass     0
dtype: int64

# step 15

In [52]:
test_df['Fare'].fillna(test_df['Fare'].dropna().median(), inplace =True)

In [53]:
test_df.isnull().sum()

PassengerId    0
Pclass         0
Sex            0
Age            0
Fare           0
Embarked       0
Title          0
IsAlone        0
Age*Pclass     0
dtype: int64

# step 16

In [54]:
train_df['FareBand'] = pd.qcut(train_df['Fare'], 4)

In [55]:
train_df['FareBand']

0       (-0.001, 7.91]
1      (31.0, 512.329]
2       (7.91, 14.454]
3      (31.0, 512.329]
4       (7.91, 14.454]
            ...
886     (7.91, 14.454]
887     (14.454, 31.0]
888     (14.454, 31.0]
889     (14.454, 31.0]
890     (-0.001, 7.91]
Name: FareBand, Length: 891, dtype: category
Categories (4, interval[float64]): [(-0.001, 7.91] < (7.91, 14.454] < (14.454, 31.0] < (31.0, 512.329]]

In [56]:
train_df[['FareBand', 'Survived']].groupby(['FareBand'], as_index = False).mean().sort_values(by = 'FareBand', ascending = True)

          FareBand  Survived
0   (-0.001, 7.91]  0.197309
1   (7.91, 14.454]  0.303571
2   (14.454, 31.0]  0.454955
3  (31.0, 512.329]  0.581081

In [57]:
for dataset in combine:
    dataset.loc[dataset['Fare'] <= 7.91, 'Fare'] = 0
    dataset.loc[(dataset['Fare'] > 7.91) & (dataset['Fare'] <= 14.454), 'Fare'] = 1
    dataset.loc[(dataset['Fare'] > 14.454) & (dataset['Fare'] <= 31.0), 'Fare'] = 2
    dataset.loc[dataset['Fare'] > 31.0, 'Fare'] = 3  
    dataset['Fare'] = dataset['Fare'].astype(int)

In [58]:
train_df = train_df.drop(['FareBand'], axis = 1)

In [59]:
combine = [train_df, test_df]

In [60]:
combine

[     Survived  Pclass  Sex  Age  Fare  Embarked  Title  IsAlone  Age*Pclass
 0           0       3    0    1     0         0      1        0           3
 1           1       1    1    2     3         1      3        0           2
 2           1       3    1    1     1         0      2        1           3
 3           1       1    1    2     3         0      3        0           2
 4           0       3    0    2     1         0      1        1           6
 ..        ...     ...  ...  ...   ...       ...    ...      ...         ...
 886         0       2    0    1     1         0      5        1           2
 887         1       1    1    1     2         0      2        1           1
 888         0       3    1    1     2         0      2        0           3
 889         1       1    0    1     2         1      1        1           1
 890         0       3    0    1     0         2      1        1           3

 [891 rows x 9 columns],
      PassengerId  Pclass  Sex  Age  Fare  Embarked  Title  IsAlone  Age*Pclass
 0            892       3    0    2     0         2    1.0        1           6
 1            893       3    1    2     0         0    3.0        0           6
 2            894       2    0    3     1         2    1.0        1           6
 3            895       3    0    1     1         0    1.0        1           3
 4            896       3    1    1     1         0    3.0        0           3
 ..           ...     ...  ...  ...   ...       ...    ...      ...         ...
 413         1305       3    0    1     1         0    1.0        1           3
 414         1306       1    1    2     3         1    0.0        1           2
 415         1307       3    0    2     0         0    1.0        1           6
 416         1308       3    0    1     1         0    1.0        1           3
 417         1309       3    0    1     2         1    4.0        0           3

 [418 rows x 9 columns]]

# Model, predict ,solve

In [61]:
#machine learning
from sklearn.linear_model import LogisticRegression

In [62]:
#drop dependent variable from x, store in y
X_train = train_df.drop(["Survived"],axis = 1)
Y_train = train_df["Survived"]

In [63]:
X_train = np.array(X_train)
#divide train_df into X_train and validation

In [64]:
X_train

array([[3, 0, 1, ..., 1, 0, 3],
       [1, 1, 2, ..., 3, 0, 2],
       [3, 1, 1, ..., 2, 1, 3],
       ...,
       [3, 1, 1, ..., 2, 0, 3],
       [1, 0, 1, ..., 1, 1, 1],
       [3, 0, 1, ..., 1, 1, 3]], dtype=int64)

In [65]:
Y_train = np.array(Y_train)

In [66]:
Y_train

array([0, 1, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1,
       1, 1, 0, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1,
       1, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 1,
       1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 1, 0, 1, 1, 0, 0,
       1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0,
       0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0,
       0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 1, 0, 1, 1, 1, 1, 0, 0,
       1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0,
       1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1,
       0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 0, 0,
       0, 0, 0, 1, 1, 1, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0,
       1, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1,
       0, 1, 1, 1, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 1, 1, 1,
       1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0,
       0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0,
       0, 1, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 1, 0,
       0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1,
       0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 0, 0,
       1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 1, 0,
       0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1,
       1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0,
       1, 1, 0, 1, 1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 1, 0, 0, 1, 0,
       0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0, 0, 1, 0, 0, 1, 1, 0, 1,
       1, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1,
       1, 1, 0, 0, 1, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0,
       0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1,
       0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0,
       0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0,
       1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1,
       0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0,
       0, 0, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 1, 0,
       1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 1,
       0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0,
       0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0,
       0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 1,
       0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 1,
       1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 1,
       1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0], dtype=int64)

In [67]:
X_test = test_df.drop("PassengerId", axis = 1).copy()

In [68]:
X_test

     Pclass  Sex  Age  Fare  Embarked  Title  IsAlone  Age*Pclass
0         3    0    2     0         2    1.0        1           6
1         3    1    2     0         0    3.0        0           6
2         2    0    3     1         2    1.0        1           6
3         3    0    1     1         0    1.0        1           3
4         3    1    1     1         0    3.0        0           3
..      ...  ...  ...   ...       ...    ...      ...         ...
413       3    0    1     1         0    1.0        1           3
414       1    1    2     3         1    0.0        1           2
415       3    0    2     0         0    1.0        1           6
416       3    0    1     1         0    1.0        1           3
417       3    0    1     2         1    4.0        0           3

[418 rows x 8 columns]

In [69]:
X_train.shape, Y_train.shape, X_test.shape

((891, 8), (891,), (418, 8))

In [70]:
#logistic regression
logreg = LogisticRegression()
logreg.fit(X_train, Y_train)
Y_pred = logreg.predict(X_test) #predict class lables

In [71]:
logreg

LogisticRegression()

In [72]:
Y_pred

array([0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 0,
       1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1,
       1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1,
       1, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1,
       1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1,
       1, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0,
       0, 0, 1, 1, 0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1,
       1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1,
       0, 1, 1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0,
       1, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1,
       0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1,
       0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0,
       0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0,
       0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0,
       1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0,
       0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 1, 0, 0, 1, 0, 0, 1, 0, 0,
       1, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1,
       0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0],
      dtype=int64)

In [73]:
acc_log = round(logreg.score(X_train, Y_train) * 100, 2) #return mean accuracy
acc_log

80.36

In [74]:
train_df

     Survived  Pclass  Sex  Age  Fare  Embarked  Title  IsAlone  Age*Pclass
0           0       3    0    1     0         0      1        0           3
1           1       1    1    2     3         1      3        0           2
2           1       3    1    1     1         0      2        1           3
3           1       1    1    2     3         0      3        0           2
4           0       3    0    2     1         0      1        1           6
..        ...     ...  ...  ...   ...       ...    ...      ...         ...
886         0       2    0    1     1         0      5        1           2
887         1       1    1    1     2         0      2        1           1
888         0       3    1    1     2         0      2        0           3
889         1       1    0    1     2         1      1        1           1
890         0       3    0    1     0         2      1        1           3

[891 rows x 9 columns]

In [75]:
from sklearn.metrics import confusion_matrix

In [76]:
confusion_matrix()
#I dont have y_test here so How do I get confusion matrix?

TypeError: confusion_matrix() missing 2 required positional arguments: 'y_true' and 'y_pred'

In [77]:
from sklearn.metrics import classification_report

In [78]:
print(classification_report(y_test, Y_pred))
#how do I get y_test ?

NameError: name 'y_test' is not defined

In [79]:
from sklearn.model_selection import train_test_split
train_size = 0.8
X = train_df.drop(["Survived"],axis = 1)
y =  train_df["Survived"]

In [ ]:
X

In [ ]:
y

In [80]:
X1_train, X_rem, y_train, y_rem = train_test_split(X,y, train_size=0.8)

In [81]:
X1_train.shape, y_train.shape, X_rem.shape, y_rem.shape
#training data, validation data

((712, 8), (712,), (179, 8), (179,))

In [82]:
#machine learning
from sklearn.linear_model import LogisticRegression

In [83]:
logreg = LogisticRegression()
logreg.fit(X1_train, y_train)
Y_pred = logreg.predict(X_rem) #predict class lables
#training data = 891 * 9 ,after splitting: training : 712 * 8 [X1_train, y_train] , validation = 179 * 8 [ X_rem, y_rem]
#testing data = 418 * 8 [ ]

In [84]:
Y_pred.shape

(179,)

In [85]:
from sklearn.metrics import confusion_matrix
pd.DataFrame(confusion_matrix(y_rem,Y_pred), columns = ['Predicted No','Predicted Yes'], index = ['Actual No','Actual Yes'])

            Predicted No  Predicted Yes
Actual No             87             19
Actual Yes            23             50

In [86]:
from sklearn.metrics import classification_report

In [87]:
print(classification_report(y_rem, Y_pred))

              precision    recall  f1-score   support

           0       0.79      0.82      0.81       106
           1       0.72      0.68      0.70        73

    accuracy                           0.77       179
   macro avg       0.76      0.75      0.75       179
weighted avg       0.76      0.77      0.76       179

# SVC

In [88]:
from sklearn.svm import SVC, LinearSVC
svc = SVC()
svc.fit(X_train, Y_train)
#non-probabilistic binary linear classifier

SVC()

In [89]:
Y_pred = svc.predict(X_test)
acc_svc = round(svc.score(X_train, Y_train) * 100, 2)

In [90]:
acc_svc

78.23

# KNN

In [92]:
from sklearn.neighbors import KNeighborsClassifier
knn = KNeighborsClassifier(n_neighbors = 3)
knn.fit(X_train, Y_train) #is k = 3 in this case?

KNeighborsClassifier(n_neighbors=3)

In [93]:
Y_pred = knn.predict(X_test)

In [94]:
Y_pred

array([0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1,
       1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1,
       1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1,
       1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0,
       1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1,
       1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1,
       0, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1,
       1, 0, 1, 1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0,
       0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0,
       1, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 1,
       1, 0, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1,
       1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0,
       0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1,
       0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0,
       1, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0,
       0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0,
       1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 1,
       0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 1],
      dtype=int64)

In [95]:
acc_knn = round(knn.score(X_train, Y_train) * 100, 2)

In [96]:
acc_knn

84.18

# Gaussian Naive Bayes

In [101]:
from sklearn.naive_bayes import GaussianNB

In [103]:
gaussian = GaussianNB()
gaussian.fit(X_train, Y_train)

GaussianNB()

In [104]:
Y_pred = gaussian.predict(X_test)
acc_gaussian = round(gaussian.score(X_train, Y_train) * 100, 2)

In [105]:
acc_gaussian

71.83

# perceptron

In [106]:
from sklearn.linear_model import Perceptron

In [107]:
perceptron = Perceptron()
perceptron.fit(X_train, Y_train)
Y_pred = perceptron.predict(X_test)
acc_perceptron = round(perceptron.score(X_train, Y_train) * 100, 2)

In [108]:
acc_perceptron

78.34

# Linear SVC

In [109]:
linear_svc = LinearSVC()
linear_svc.fit(X_train, Y_train)
Y_pred = linear_svc.predict(X_test)
acc_linear_svc = round(linear_svc.score(X_train, Y_train) * 100, 2)

D:\Anaconda\lib\site-packages\sklearn\svm\_base.py:985: ConvergenceWarning: Liblinear failed to converge, increase the number of iterations.
  warnings.warn("Liblinear failed to converge, increase "

In [110]:
acc_linear_svc

79.12

# Stochastic Gradient Descent

In [111]:
from sklearn.linear_model import SGDClassifier

In [112]:
sgd = SGDClassifier()
sgd.fit(X_train, Y_train)
Y_pred = sgd.predict(X_test)
acc_sgd = round(sgd.score(X_train, Y_train) * 100, 2)

In [113]:
acc_sgd

75.87

# Decision Tree

In [114]:
from sklearn.tree import DecisionTreeClassifier
decision_tree = DecisionTreeClassifier()
decision_tree.fit(X_train, Y_train)
Y_pred = decision_tree.predict(X_test)
acc_decision_tree = round(decision_tree.score(X_train, Y_train) * 100, 2)

In [115]:
acc_decision_tree

86.76

# Random Forest

In [116]:
from sklearn.ensemble import RandomForestClassifier
random_forest = RandomForestClassifier(n_estimators=100)
random_forest.fit(X_train, Y_train)
Y_pred = random_forest.predict(X_test)
random_forest.score(X_train, Y_train)
acc_random_forest = round(random_forest.score(X_train, Y_train) * 100, 2)

In [117]:
acc_random_forest

86.76

# Model Evaluation

In [118]:
models = pd.DataFrame({
    'Model': ['Support Vector Machines', 'KNN', 'Logistic Regression', 
              'Random Forest', 'Naive Bayes', 'Perceptron', 
              'Stochastic Gradient Decent', 'Linear SVC', 
              'Decision Tree'],
    'Score': [acc_svc, acc_knn, acc_log, 
              acc_random_forest, acc_gaussian, acc_perceptron, 
              acc_sgd, acc_linear_svc, acc_decision_tree]})
models.sort_values(by='Score', ascending=False)

                        Model  Score
3               Random Forest  86.76
8               Decision Tree  86.76
1                         KNN  84.18
2         Logistic Regression  80.36
7                  Linear SVC  79.12
5                  Perceptron  78.34
0     Support Vector Machines  78.23
6  Stochastic Gradient Decent  75.87
4                 Naive Bayes  71.83